---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleData.BodyShowsVerticalHeaders
source: html/405680fb-34f3-97b1-557f-0966257b5dbe.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.BodyShowsVerticalHeaders Property

Shows text in the Load Summary section's headers vertically instead of horizontally

## Syntax (C#)
```csharp
public bool BodyShowsVerticalHeaders { get; }
```

## Remarks
Setting this value must go through the appropriate update function (updateVerticalHeadersInSection)